# ****************************
# 初识Python02
# ****************************


# ****************************
# 初识Python02  -- 指令和程序
# ****************************
""""""

"""
计算机硬件通常有五大部件构成：运算器，控制器，存储器，输入设备和输出设备
"""


# ****************************
# 初识Python02  -- 变量和类型
# ****************************

"""
整型
浮点型
字符串型
布尔型
复数型
"""


# ****************************
# 初识Python02  -- 变量命名
# ****************************


# ****************************
# 初识Python02  -- 变量的使用
# ****************************

"""
使用变量保存数据并进行算术运算

Version：0.1
Author：Ableson
"""

a = 321
b = 123
print('********使用变量保存数据并进行算术运算********')
print(a+b)
print(a-b)


"""
使用input函数输入
使用int()进行类型转换
用占位符格式化输出的字符串

Version：0.1
Author：Ableson
"""

print('********使用input()函数输入********')
a = int(input('a = '))
b = int(input('b = '))
print('%d + %d = %d'%(a,b,a+b))


"""
使用type()检查变量类型

Version：0.1
Author：Ableson
Date：2019-05-20
"""
print('********使用type()检查变量类型********')
a = 100
b = 12.3
print(type(a))
print(type(b))





# ****************************
# 初识Python02  -- 练习1：华氏温度转摄氏温度
# ****************************

"""
将华氏温度转换为摄氏温度
F = 1.8C + 32

Version：0.1
Author：Ableson
Date：2019-05-20
"""
print('********将华氏温度转换为摄氏温度********')
f = float(input('请输入华氏温度: '))
c = (f - 32)/1.8
print('%.1f华氏温度 = %.1f设置温度' %(f,c))


# ****************************
# 初识Python02  -- 练习2：输入圆的半径计算周长和面积
# ****************************

"""
输入圆的半径计算周长和面积

Version：0.1
Author：Ableson
"""
import math

print('********输入圆的半径计算周长和面积********')
radius = float(input('请输入圆的半径: '))
perimeter = 2 * math.pi * radius
area = math.pi * radius * radius
print('周长:%.2f'%(perimeter))
print('面积:%.2f'%(area))


# ****************************
# 初识Python02  -- 练习3：输入年份判断是不是闰年
# ****************************

"""
输入年份判断是不是闰年

Version：0.1
Author：Ableson
Date：2019-05-20
"""

print('********输入年份判断是不是闰年********')
year = int(input('请输入年份: '))
is_leap = (year % 4 == 0 and year % 100 != 0 or year % 400 == 0)
print(is_leap)

